## Plan Result (test-frontdoor)




<pre><code>Plan: 16 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.frontdoor_for_testing_migration.azurerm_frontdoor.main
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;pip-frontend&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;portal-test&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;sds-api-mgmt&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;toffee&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;vh-admin-web&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;vh-test-web&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;vh-video-web&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;pip-frontend&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;portal-test&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;sds-api-mgmt&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;toffee&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;vh-admin-web&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;vh-test-web&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;vh-video-web&#34;]
  * module.frontdoor_for_testing_migration.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.frontdoor_for_testing_migration.azurerm_frontdoor.main will be created
  + resource "azurerm_frontdoor" "main" {
      + backend_pool_health_probes           = (known after apply)
      + backend_pool_load_balancing_settings = (known after apply)
      + backend_pools                        = (known after apply)
      + cname                                = (known after apply)
      + explicit_resource_order              = (known after apply)
      + friendly_name                        = "hmcts-test-sbox"
      + frontend_endpoints                   = (known after apply)
      + header_frontdoor_id                  = (known after apply)
      + id                                   = (known after apply)
      + load_balancer_enabled                = true
      + name                                 = "hmcts-test-sbox"
      + resource_group_name                  = "lz-test-rg"
      + routing_rules                        = (known after apply)
      + tags                                 = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }

      + backend_pool {
          + health_probe_name   = "defaultHealthProbe"
          + id                  = (known after apply)
          + load_balancing_name = "defaultLoadBalancing"
          + name                = "defaultBackend"

          + backend {
              + address     = "www.bing.com"
              + enabled     = true
              + host_header = "www.bing.com"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-toffee"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-toffee"
          + name                = "toffee"

          + backend {
              + address     = "firewall-nonprodi-palo-sdstest.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "toffee.test.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-pip-frontend"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-pip-frontend"
          + name                = "pip-frontend"

          + backend {
              + address     = "firewall-nonprodi-palo-sdstest.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "pip-frontend.test.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-vh-test-web"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-vh-test-web"
          + name                = "vh-test-web"

          + backend {
              + address     = "firewall-nonprodi-palo-sdstest.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "vh-test-web.test.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-vh-video-web"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-vh-video-web"
          + name                = "vh-video-web"

          + backend {
              + address     = "firewall-nonprodi-palo-sdstest.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "vh-video-web.test.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-vh-admin-web"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-vh-admin-web"
          + name                = "vh-admin-web"

          + backend {
              + address     = "firewall-nonprodi-palo-sdstest.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "vh-admin-web.test.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-sds-api-mgmt"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-sds-api-mgmt"
          + name                = "sds-api-mgmt"

          + backend {
              + address     = "firewall-nonprodi-palo-sdsapimgmttest.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "sds-api-mgmt.test.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-portal-test"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-portal-test"
          + name                = "portal-test"

          + backend {
              + address     = "pre-testing.powerappsportals.com"
              + enabled     = true
              + host_header = "portal-test.pre-recorded-evidence.justice.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }

      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "defaultHealthProbe"
          + path                = "/"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-toffee"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-pip-frontend"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-vh-test-web"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-vh-video-web"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-vh-admin-web"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-sds-api-mgmt"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-portal-test"
          + path                = "/SignIn?ReturnUrl=%2F"
          + probe_method        = "GET"
          + protocol            = "Https"
        }

      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + id                              = (known after apply)
          + name                            = "defaultLoadBalancing"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + id                              = (known after apply)
          + name                            = "loadBalancingSettings-toffee"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + id                              = (known after apply)
          + name                            = "loadBalancingSettings-pip-frontend"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + id                              = (known after apply)
          + name                            = "loadBalancingSettings-vh-test-web"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + id                              = (known after apply)
          + name                            = "loadBalancingSettings-vh-video-web"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + id                              = (known after apply)
          + name                            = "loadBalancingSettings-vh-admin-web"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + id                              = (known after apply)
          + name                            = "loadBalancingSettings-sds-api-mgmt"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + id                              = (known after apply)
          + name                            = "loadBalancingSettings-portal-test"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }

      + backend_pool_settings {
          + backend_pools_send_receive_timeout_seconds   = 60
          + enforce_backend_pools_certificate_name_check = true
        }

      + frontend_endpoint {
          + host_name                    = "hmcts-test-sbox.azurefd.net"
          + id                           = (known after apply)
          + name                         = "hmcts-test-sbox-azurefd-net"
          + session_affinity_enabled     = false
          + session_affinity_ttl_seconds = 0
        }
      + frontend_endpoint {
          + host_name                               = "toffee.test.platform.hmcts.net"
          + id                                      = (known after apply)
          + name                                    = "toffee"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "pip-frontend.test.platform.hmcts.net"
          + id                                      = (known after apply)
          + name                                    = "pip-frontend"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "vh-test-web.test.platform.hmcts.net"
          + id                                      = (known after apply)
          + name                                    = "vh-test-web"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "vh-video-web.test.platform.hmcts.net"
          + id                                      = (known after apply)
          + name                                    = "vh-video-web"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "vh-admin-web.test.platform.hmcts.net"
          + id                                      = (known after apply)
          + name                                    = "vh-admin-web"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "sds-api-mgmt.test.platform.hmcts.net"
          + id                                      = (known after apply)
          + name                                    = "sds-api-mgmt"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "portal-test.pre-recorded-evidence.justice.gov.uk"
          + id                                      = (known after apply)
          + name                                    = "portal-test"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }

      + routing_rule {
          + accepted_protocols = [
              + "Http",
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "hmcts-test-sbox-azurefd-net",
            ]
          + id                 = (known after apply)
          + name               = "defaultRouting"
          + patterns_to_match  = [
              + "/*",
            ]

          + forwarding_configuration {
              + backend_pool_name                     = "defaultBackend"
              + cache_enabled                         = false
              + cache_query_parameter_strip_directive = "StripAll"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "MatchRequest"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "toffee",
            ]
          + id                 = (known after apply)
          + name               = "toffee"
          + patterns_to_match  = [
              + "/*",
            ]

          + forwarding_configuration {
              + backend_pool_name                     = "toffee"
              + cache_enabled                         = true
              + cache_query_parameter_strip_directive = "StripNone"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "pip-frontend",
            ]
          + id                 = (known after apply)
          + name               = "pip-frontend"
          + patterns_to_match  = [
              + "/*",
            ]

          + forwarding_configuration {
              + backend_pool_name                     = "pip-frontend"
              + cache_enabled                         = true
              + cache_query_parameter_strip_directive = "StripNone"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "vh-test-web",
            ]
          + id                 = (known after apply)
          + name               = "vh-test-web"
          + patterns_to_match  = [
              + "/*",
            ]

          + forwarding_configuration {
              + backend_pool_name                     = "vh-test-web"
              + cache_enabled                         = false
              + cache_query_parameter_strip_directive = "StripAll"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "vh-video-web",
            ]
          + id                 = (known after apply)
          + name               = "vh-video-web"
          + patterns_to_match  = [
              + "/*",
            ]

          + forwarding_configuration {
              + backend_pool_name                     = "vh-video-web"
              + cache_enabled                         = false
              + cache_query_parameter_strip_directive = "StripAll"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "vh-admin-web",
            ]
          + id                 = (known after apply)
          + name               = "vh-admin-web"
          + patterns_to_match  = [
              + "/*",
            ]

          + forwarding_configuration {
              + backend_pool_name                     = "vh-admin-web"
              + cache_enabled                         = false
              + cache_query_parameter_strip_directive = "StripAll"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "sds-api-mgmt",
            ]
          + id                 = (known after apply)
          + name               = "sds-api-mgmt"
          + patterns_to_match  = [
              + "/*",
            ]

          + forwarding_configuration {
              + backend_pool_name                     = "sds-api-mgmt"
              + cache_enabled                         = false
              + cache_query_parameter_strip_directive = "StripAll"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "portal-test",
            ]
          + id                 = (known after apply)
          + name               = "portal-test"
          + patterns_to_match  = [
              + "/*",
            ]

          + forwarding_configuration {
              + backend_pool_name                     = "portal-test"
              + cache_enabled                         = false
              + cache_query_parameter_strip_directive = "StripAll"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpsOnly"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "toffee",
            ]
          + id                 = (known after apply)
          + name               = "toffeeHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "pip-frontend",
            ]
          + id                 = (known after apply)
          + name               = "pip-frontendHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "vh-test-web",
            ]
          + id                 = (known after apply)
          + name               = "vh-test-webHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "vh-video-web",
            ]
          + id                 = (known after apply)
          + name               = "vh-video-webHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "vh-admin-web",
            ]
          + id                 = (known after apply)
          + name               = "vh-admin-webHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "sds-api-mgmt",
            ]
          + id                 = (known after apply)
          + name               = "sds-api-mgmtHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "portal-test",
            ]
          + id                 = (known after apply)
          + name               = "portal-testHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https["pip-frontend"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/hmcts-test-sbox/frontendEndpoints/pip-frontend"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https["portal-test"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/hmcts-test-sbox/frontendEndpoints/portal-test"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https["sds-api-mgmt"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/hmcts-test-sbox/frontendEndpoints/sds-api-mgmt"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https["toffee"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/hmcts-test-sbox/frontendEndpoints/toffee"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https["vh-admin-web"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/hmcts-test-sbox/frontendEndpoints/vh-admin-web"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https["vh-test-web"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/hmcts-test-sbox/frontendEndpoints/vh-test-web"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https["vh-video-web"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/hmcts-test-sbox/frontendEndpoints/vh-video-web"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["pip-frontend"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "pipfrontendsbox"
      + resource_group_name   = "lz-test-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }

      + custom_rule {
          + action                         = "Block"
          + enabled                        = true
          + name                           = "ManualUploadPathTraversalGeneral"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "../",
                  + "..\\",
                ]
              + match_variable     = "RequestBody"
              + negation_condition = false
              + operator           = "Contains"
              + transforms         = [
                  + "UrlDecode",
                ]
            }
          + match_condition {
              + match_values       = [
                  + "/manual-upload",
                ]
              + match_variable     = "RequestUri"
              + negation_condition = true
              + operator           = "EndsWith"
            }
          + match_condition {
              + match_values       = [
                  + "POST",
                ]
              + match_variable     = "RequestMethod"
              + negation_condition = false
              + operator           = "Equal"
            }
        }
      + custom_rule {
          + action                         = "Block"
          + enabled                        = true
          + name                           = "ManualUploadPathTraversalNonEncode"
          + priority                       = 2
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "..%c0%af",
                  + "..%c1%9c",
                ]
              + match_variable     = "RequestBody"
              + negation_condition = false
              + operator           = "Contains"
            }
          + match_condition {
              + match_values       = [
                  + "/manual-upload",
                ]
              + match_variable     = "RequestUri"
              + negation_condition = true
              + operator           = "EndsWith"
            }
          + match_condition {
              + match_values       = [
                  + "POST",
                ]
              + match_variable     = "RequestMethod"
              + negation_condition = false
              + operator           = "Equal"
            }
        }
      + custom_rule {
          + action                         = "Block"
          + enabled                        = true
          + name                           = "ManualUploadPathTraversalRegex"
          + priority                       = 3
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "([a-z]:\\\\)|(%252e|\\.)(%252e|\\.)(%255c|%252f|\\\\|\\/)",
                ]
              + match_variable     = "RequestBody"
              + negation_condition = false
              + operator           = "RegEx"
              + transforms         = [
                  + "Lowercase",
                ]
            }
          + match_condition {
              + match_values       = [
                  + "/manual-upload",
                ]
              + match_variable     = "RequestUri"
              + negation_condition = true
              + operator           = "EndsWith"
            }
          + match_condition {
              + match_values       = [
                  + "POST",
                ]
              + match_variable     = "RequestMethod"
              + negation_condition = false
              + operator           = "Equal"
            }
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "redirect_uri"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "desc"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "StartsWith"
              + selector       = "x-ms-cpim-"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "diags"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "redirect_uri"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "error_description"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "court-and-tribunal-hearings-cookie-preferences"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "claim_value"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "ReadOnlyEmail"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "nonce"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "state"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "session.sig"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "iss"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtSa"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "createAdminAccount"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "formCookie"
            }

          + override {
              + rule_group_name = "LFI"

              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "930110"
                }
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["portal-test"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "portaltestsbox"
      + resource_group_name   = "lz-test-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }

      + custom_rule {
          + action                         = "Block"
          + enabled                        = true
          + name                           = "CountryMatchWhitelist"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "GB",
                ]
              + match_variable     = "RemoteAddr"
              + negation_condition = true
              + operator           = "GeoMatch"
            }
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + override {
              + rule_group_name = "RCE"

              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "932100"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "932110"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "932115"
                }
            }
          + override {
              + rule_group_name = "SQLI"

              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942440"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942450"
                }
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["sds-api-mgmt"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "sdsapimgmtsbox"
      + resource_group_name   = "lz-test-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["toffee"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "toffeesbox"
      + resource_group_name   = "lz-test-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["vh-admin-web"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "vhadminwebsbox"
      + resource_group_name   = "lz-test-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["vh-test-web"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "vhtestwebsbox"
      + resource_group_name   = "lz-test-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["vh-video-web"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "vhvideowebsbox"
      + resource_group_name   = "lz-test-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be created
  + resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                           = "fd-log-analytics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "FrontdoorAccessLog"

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
      + enabled_log {
          + category = "FrontdoorWebApplicationFirewallLog"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
    }

Plan: 16 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":475,"Program":"tfcmt","SHA1":"","Target":"test-frontdoor","Vars":{}} -->